Documents/ЗаданияДляАвтоинформирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаданияДляАвтоинформирования</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоследовательностиКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИ</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СостоянияПоАвтоинформированию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СостоянияПоАвтоинформированию</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВариантыДействийДляСкоринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыДействийДляСкоринга</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMSОповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EMailРассылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданияДляАвтоинформирования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.СостоянияПоАвтоинформированию.Записывать = Истина;
	
	ФайлТСИ = Новый ТекстовыйДокумент();
	УчеткаEmail = Константы.УчеткаEMailРассылок.Получить();
	Почта = Справочники.ШаблоныТекстаДляАвтоинформирования.СоздатьОбъектПочта(УчеткаEmail);
	МассивПолучателей = Новый Массив();
	ДатаАктуальности = Формат(ТекущаяДата() + ДнейНаВыполнение * 3600 * 24, "ДФ=yyyyMMdd");
		
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		ОтказДействия = Ложь;
		Если Элемент.Действие.Пустая() ИЛИ Элемент.Объект.Пустая() ИЛИ Элемент.Шаблон.Пустая() Тогда
			ОтказДействия = Истина;
		КонецЕсли;
		
		Если ОтказДействия Тогда
			Продолжить;
		КонецЕсли;
		
		
		УИД = Новый УникальныйИдентификатор();
		Если Элемент.Действие = Перечисления.ВариантыДействийДляСкоринга.ПроизвольноеДействие Тогда
			Действие = Элемент.Шаблон;
			Справочники.ШаблоныТекстаДляАвтоинформирования.ВыполнитьПроизвольноеДействие(Элемент.Шаблон.Действие);
			
		//ИначеЕсли Элемент.Действие = Перечисления.ВариантыДействийДляСкоринга.EMailРассылка Тогда
		//	//Блок отвечает за рассылку e-mail из под ЦУЗ
		//	МассивПолучателей.Очистить();
		//	
		//	//Блок надо заменить процедурой		
		//	ТелефонАдрес = "";
		//	Если Элемент.ВидКИ.ЭтоДополнительноеСведение Тогда
		//		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		//		Запись.Объект = Элемент.Должник;
		//		Запись.Свойство = Элемент.ВидКИ;
		//		Запись.Прочитать();
		//		ТелефонАдрес = Запись.Значение;
		//	Иначе
		//		Свойства = Элемент.Должник.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Элемент.ВидКИ));
		//		Если Свойства.Количество() > 0 Тогда
		//			ТелефонАдрес = Свойства[0].Значение;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	Если ЗначениеЗаполнено(ТелефонАдрес) Тогда
		//		МассивПолучателей.Добавить(ТелефонАдрес);
		//	КонецЕсли;
		//	//блок

		//	Справочники.ШаблоныТекстаДляАвтоинформирования.ОтправитьEMail(Почта, УчеткаEmail, Элемент.Шаблон,
		//			Элемент.Организация, Элемент.Должник, Элемент.ДолговоеОбязательство, МассивПолучателей, ОтказДействия);
			
		Иначе	 
			Действие = Элемент.Действие;
			Документы.ЗаданияДляАвтоинформирования.ДобавитьЗаписьВФайлТСИ(ФайлТСИ, Элемент.Объект, Элемент.Шаблон, Строка(УИД), 
					Элемент.Действие, ВидКИ, ОтказДействия, ДатаАктуальности);
		КонецЕсли; 
		
		
		Если Не ОтказДействия Тогда	
			Движение = Движения.СостоянияПоАвтоинформированию.Добавить();
			Движение.Регистратор = ЭтотОбъект.Ссылка;
			Движение.Период = Дата;
			Движение.Объект = Элемент.Объект;
			Движение.Действие = Действие;					
			Движение.УИД = УИД;		
		КонецЕсли;	
	КонецЦикла;
	
	Если ФайлТСИ.КоличествоСтрок() > 0 Тогда
		Документы.ЗаданияДляАвтоинформирования.ЗаписатьФайлТСИ(ФайлТСИ, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	Если Почта <> Неопределено Тогда
		Почта.Отключиться();
	КонецЕсли;
КонецПроцедуры

Функция ОтправитьEMailСообщение(Почта, УчеткаEmail, ТекстСообщения)
	Письмо = Новый ИнтернетПочтовоеСообщение();	
	Письмо.Тема = "ЖЖЖ"; 
	Текст = Письмо.Тексты.Добавить(ТекстСообщения);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.ИмяОтправителя = "ППП";
	//Письмо.Отправитель.Адрес = "mav@trsoft.ru"; 
	Письмо.Отправитель.ОтображаемоеИмя = "ФФФ"; 
	//Письмо.ОбратныйАдрес.Добавить("mav@trsoft.ru");
	Письмо.Получатели.Добавить("san_pancho@mail.ru");
	
	//Для каждого ФайлОтправки Из ФайлыОтправки Цикл		
	//	ПроверкаФайл = Новый Файл(ФайлОтправки);		
	//	Если ПроверкаФайл.Существует() Тогда
	//		Письмо.Вложения.Добавить(ПроверкаФайл.ПолноеИмя, "Файл предложения от Кампании");  				
	//	КонецЕсли;
	//КонецЦикла; 	
	
	Почта.Послать(Письмо);
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если Не Действие.Пустая() ИЛИ Не ВидКИ.Пустая() ИЛИ Не Шаблон.Пустая() Тогда
		ТЗ = Объекты.Выгрузить();
		Если Не Действие.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(Действие, "Действие");		
		КонецЕсли;	
		Если Не ЭтотОбъект.ВидКИ.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(ВидКИ, "ВидКИ");
		КонецЕсли;	
		Если Не ЭтотОбъект.Шаблон.Пустая() Тогда
			ТЗ.ЗаполнитьЗначения(Шаблон, "Шаблон");
		КонецЕсли;	
		Объекты.Загрузить(ТЗ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры
